package com.qianlima.offline.util;


import lombok.extern.slf4j.Slf4j;
import org.apache.commons.lang3.StringUtils;
import org.springframework.stereotype.Component;

@Slf4j
@Component
public class BaoXianRule {

    public String ruleVerification(String title, String content, String infoId) {

        String resultTag = "";
        if (StringUtils.isBlank(title) || "无".equals(title) || StringUtils.isBlank(content)) {
            return resultTag;
        }
        content = content + "&" + title; //将内容和标题链接
        content = content.toUpperCase();

        String tagOne = checkGongChengXian(content);
        if (StringUtils.isNotBlank(tagOne)) {
            resultTag += tagOne;
            resultTag += "&";
        }

        String tagTwo = checkChuanBoXian(content);
        if (StringUtils.isNotBlank(tagTwo)) {
            resultTag += tagTwo;
            resultTag += "&";
        }

        String tagThree = checkCarXian(content);
        if (StringUtils.isNotBlank(tagThree)) {
            resultTag += tagThree;
            resultTag += "&";
        }

        String tagFour = checkCaiChanXian(content);
        if (StringUtils.isNotBlank(tagFour)) {
            resultTag += tagFour;
            resultTag += "&";
        }

        String tagFive = checkJianKangXian(content);
        if (StringUtils.isNotBlank(tagFive)) {
            resultTag += tagFive;
            resultTag += "&";
        }

        String tagSix = checkTongYongXian(content);
        if (StringUtils.isNotBlank(tagSix)) {
            resultTag += tagSix;
            resultTag += "&";
        }

        if (StringUtils.isNotBlank(resultTag)) {
            resultTag = resultTag.substring(0, resultTag.length() - 1);
            boolean contains = false;
            for (String s : X) {
                contains = content.contains(s);
                if (contains == true) {
                    resultTag = "";
                    log.info("人保财规则匹配失败，info_id：{}，全文中匹配到了黑词", infoId);
                    break;
                }
            }

        }
        return resultTag;
    }


    /**
     * 保险-工程险
     */
    private String checkGongChengXian(String allContent) {
        boolean contains = false;
        for (String s : A) {
            contains = allContent.contains(s);
            if (contains) {
                break;
            }
        }
        if (contains == true) {
            return GONGCHENG_XIAN;
        }
        return "";
    }

    /**
     * 保险-船舶险
     */
    private String checkChuanBoXian(String allContent) {
        boolean contains = false;
        for (String s : B) {
            contains = allContent.contains(s);
            if (contains) {
                break;
            }
        }
        if (contains == true) {
            return CHUANBO_XIAN;
        }
        return "";
    }

    /**
     * 保险-车险
     */
    private String checkCarXian(String allContent) {
        boolean contains = false;
        for (String s : C) {
            contains = allContent.contains(s);
            if (contains) {
                break;
            }
        }
        if (contains == true) {
            return CAR_XIAN;
        }
        return "";
    }

    /**
     * 保险-财产险
     */
    private String checkCaiChanXian(String allContent) {
        boolean contains = false;
        for (String s : D) {
            contains = allContent.contains(s);
            if (contains) {
                break;
            }
        }
        if (contains == true) {
            return CAICHAN_XIAN;
        }
        return "";
    }

    /**
     * 保险-健康险
     */
    private String checkJianKangXian(String allContent) {
        boolean contains = false;
        for (String s : E) {
            contains = allContent.contains(s);
            if (contains) {
                break;
            }
        }
        if (contains == true) {
            return JIANKANG_XIAN;
        }
        return "";
    }

    /**
     * 保险-通用险
     */
    private String checkTongYongXian(String allContent) {
        boolean contains = false;
        for (String s : F) {
            contains = allContent.contains(s);
            if (contains) {
                break;
            }
        }
        if (contains == true) {
            return TONGYONG_XIAN;
        }
        return "";
    }

    private static final String GONGCHENG_XIAN = "工程险";

    private static final String CHUANBO_XIAN = "船舶险";

    private static final String CAR_XIAN = "车险";

    private static final String CAICHAN_XIAN = "财产险";

    private static final String JIANKANG_XIAN = "健康险";

    private static final String TONGYONG_XIAN = "通用险";
    /**
     * 保险-工程险
     */
    private static final String[] A = {"在建工程投保", "在建工程)投保", "工程运营期保险", "工程质量潜在缺陷保险", "隧道段)保险", "路保险", "隧道段保险", "建设项目保险", "BOT项目保险", "BOT项目综合保险", "BOT项目", "建安一切险", "PPP项目保险", "PPP项目综合保险", "工程险", "工程投保", "工程承保", "工程保险", "工程续保", "工程综合险", "工程综合保险", "工程一切险", "工程一切保险", "工程一揽子保险", "工程保障计划", "建筑险", "建筑投保", "建筑承保", "建筑保险", "建筑续保", "建筑综合险", "建筑综合保险", "建筑一切险", "建筑一切保险", "建筑一揽子保险", "建筑保障计划", "工程项目险", "工程项目投保", "工程项目承保", "工程项目保险", "工程项目续保", "工程项目综合险", "工程项目综合保险", "工程项目一切险", "工程项目一切保险", "工程项目一揽子保险", "工程项目保障计划", "建筑项目险", "建筑项目投保", "建筑项目承保", "建筑项目保险", "建筑项目续保", "建筑项目综合险", "建筑项目综合保险", "建筑项目一切险", "建筑项目一切保险", "建筑项目一揽子保险", "建筑项目保障计划", "施工总承包险", "施工总承包投保", "施工总承包承保", "施工总承包保险", "施工总承包续保", "施工总承包综合险", "施工总承包综合保险", "施工总承包一切险", "施工总承包一切保险", "施工总承包一揽子保险", "施工总承包保障计划", "总承包项目险", "总承包项目投保", "总承包项目承保", "总承包项目保险", "总承包项目续保", "总承包项目综合险", "总承包项目综合保险", "总承包项目一切险", "总承包项目一切保险", "总承包项目一揽子保险", "总承包项目保障计划", "工程调整方案险", "工程调整方案投保", "工程调整方案承保", "工程调整方案保险", "工程调整方案续保", "工程调整方案综合险", "工程调整方案综合保险", "工程调整方案一切险", "工程调整方案一切保险", "工程调整方案一揽子保险", "工程调整方案保障计划", "改造项目险", "改造项目投保", "改造项目承保", "改造项目保险", "改造项目续保", "改造项目综合险", "改造项目综合保险", "改造项目一切险", "改造项目一切保险", "改造项目一揽子保险", "改造项目保障计划", "一期运营险", "一期运营投保", "一期运营承保", "一期运营保险", "一期运营续保", "一期运营综合险", "一期运营综合保险", "一期运营一切险", "一期运营一切保险", "一期运营一揽子保险", "一期运营保障计划", "一期运营期险", "一期运营期投保", "一期运营期承保", "一期运营期保险", "一期运营期续保", "一期运营期综合险", "一期运营期综合保险", "一期运营期一切险", "一期运营期一切保险", "一期运营期一揽子保险", "一期运营期保障计划", "桥运营险", "桥运营投保", "桥运营承保", "桥运营保险", "桥运营续保", "桥运营综合险", "桥运营综合保险", "桥运营一切险", "桥运营一切保险", "桥运营一揽子保险", "桥运营保障计划", "建造险", "建造投保", "建造承保", "建造保险", "建造续保", "建造综合险", "建造综合保险", "建造一切险", "建造一切保险", "建造一揽子保险", "建造保障计划", "年度运营期险", "年度运营期投保", "年度运营期承保", "年度运营期保险", "年度运营期续保", "年度运营期综合险", "年度运营期综合保险", "年度运营期一切险", "年度运营期一切保险", "年度运营期一揽子保险", "年度运营期保障计划", "年度运营险", "年度运营投保", "年度运营承保", "年度运营保险", "年度运营续保", "年度运营综合险", "年度运营综合保险", "年度运营一切险", "年度运营一切保险", "年度运营一揽子保险", "年度运营保障计划", "营运期险", "营运期投保", "营运期承保", "营运期保险", "营运期续保", "营运期综合险", "营运期综合保险", "营运期一切险", "营运期一切保险", "营运期一揽子保险", "营运期保障计划"};
    /**
     * 保险-船舶险
     */
    private static final String[] B = {"船舶险", "船舶投保", "船舶承保", "船舶保险", "船舶续保", "船舶综合险", "船舶综合保险", "船舶一切险", "船舶一切保险", "船舶一揽子保险", "船舶保障计划", "船险", "船投保", "船承保", "船保险", "船续保", "船综合险", "船综合保险", "船一切险", "船一切保险", "船一揽子保险", "船保障计划", "艇险", "艇投保", "艇承保", "艇保险", "艇续保", "艇综合险", "艇综合保险", "艇一切险", "艇一切保险", "艇一揽子保险", "艇保障计划", "船壳险", "船壳投保", "船壳承保", "船壳保险", "船壳续保", "船壳综合险", "船壳综合保险", "船壳一切险", "船壳一切保险", "船壳一揽子保险", "船壳保障计划", "船机险", "船机投保", "船机承保", "船机保险", "船机续保", "船机综合险", "船机综合保险", "船机一切险", "船机一切保险", "船机一揽子保险", "船机保障计划"};
    /**
     * 保险-车险
     */
    private static final String[] C = {"交强险", "车购保险", "交通事故责任强制保险", "车辆购买商业保险", "车损险", "不计免赔险", "车险", "车投保", "车承保", "车保险", "车续保", "车综合险", "车综合保险", "车一切险", "车一切保险", "车一揽子保险", "车保障计划", "车辆险", "车辆投保", "车辆承保", "车辆保险", "车辆续保", "车辆综合险", "车辆综合保险", "车辆一切险", "车辆一切保险", "车辆一揽子保险", "车辆保障计划"};
    /**
     * 保险-财产
     */
    private static final String[] D = {"财产险", "财产投保", "财产承保", "财产保险", "财产续保", "财产综合险", "财产综合保险", "财产一切险", "财产一切保险", "财产一揽子保险", "财产保障计划", "信用险", "信用投保", "信用承保", "信用保险", "信用续保", "信用综合险", "信用综合保险", "信用一切险", "信用一切保险", "信用一揽子保险", "信用保障计划", "财险", "财投保", "财承保", "财保险", "财续保", "财综合险", "财综合保险", "财一切险", "财一切保险", "财一揽子保险", "财保障计划", "损坏险", "损坏投保", "损坏承保", "损坏保险", "损坏续保", "损坏综合险", "损坏综合保险", "损坏一切险", "损坏一切保险", "损坏一揽子保险", "损坏保障计划", "资产险", "资产投保", "资产承保", "资产保险", "资产续保", "资产综合险", "资产综合保险", "资产一切险", "资产一切保险", "资产一揽子保险", "资产保障计划", "现金险", "现金投保", "现金承保", "现金保险", "现金续保", "现金综合险", "现金综合保险", "现金一切险", "现金一切保险", "现金一揽子保险", "现金保障计划", "收益险", "收益投保", "收益承保", "收益保险", "收益续保", "收益综合险", "收益综合保险", "收益一切险", "收益一切保险", "收益一揽子保险", "收益保障计划", "保证险", "保证投保", "保证承保", "保证保险", "保证续保", "保证综合险", "保证综合保险", "保证一切险", "保证一切保险", "保证一揽子保险", "保证保障计划", "损失险", "损失投保", "损失承保", "损失保险", "损失续保", "损失综合险", "损失综合保险", "损失一切险", "损失一切保险", "损失一揽子保险", "损失保障计划", "破碎险", "破碎投保", "破碎承保", "破碎保险", "破碎续保", "破碎综合险", "破碎综合保险", "破碎一切险", "破碎一切保险", "破碎一揽子保险", "破碎保障计划", "盗刷险", "盗刷投保", "盗刷承保", "盗刷保险", "盗刷续保", "盗刷综合险", "盗刷综合保险", "盗刷一切险", "盗刷一切保险", "盗刷一揽子保险", "盗刷保障计划", "盗窃险", "盗窃投保", "盗窃承保", "盗窃保险", "盗窃续保", "盗窃综合险", "盗窃综合保险", "盗窃一切险", "盗窃一切保险", "盗窃一揽子保险", "盗窃保障计划", "盗抢险", "盗抢投保", "盗抢承保", "盗抢保险", "盗抢续保", "盗抢综合险", "盗抢综合保险", "盗抢一切险", "盗抢一切保险", "盗抢一揽子保险", "盗抢保障计划", "碎屏险", "碎屏投保", "碎屏承保", "碎屏保险", "碎屏续保", "碎屏综合险", "碎屏综合保险", "碎屏一切险", "碎屏一切保险", "碎屏一揽子保险", "碎屏保障计划", "航班延误险", "航班延误投保", "航班延误承保", "航班延误保险", "航班延误续保", "航班延误综合险", "航班延误综合保险", "航班延误一切险", "航班延误一切保险", "航班延误一揽子保险", "航班延误保障计划", "银行卡安全险", "银行卡安全投保", "银行卡安全承保", "银行卡安全保险", "银行卡安全续保", "银行卡安全综合险", "银行卡安全综合保险", "银行卡安全一切险", "银行卡安全一切保险", "银行卡安全一揽子保险", "银行卡安全保障计划", "家居险", "家居投保", "家居承保", "家居保险", "家居续保", "家居综合险", "家居综合保险", "家居一切险", "家居一切保险", "家居一揽子保险", "家居保障计划", "行李险", "行李投保", "行李承保", "行李保险", "行李续保", "行李综合险", "行李综合保险", "行李一切险", "行李一切保险", "行李一揽子保险", "行李保障计划", "商业险", "商业投保", "商业承保", "商业保险", "商业续保", "商业综合险", "商业综合保险", "商业一切险", "商业一切保险", "商业一揽子保险", "商业保障计划"};
    /**
     * 保险-健康
     */
    private static final String[] E = {"意外险", "意外投保", "意外承保", "意外保险", "意外续保", "意外综合险", "意外综合保险", "意外一切险", "意外一切保险", "意外一揽子保险", "意外保障计划", "健康险", "健康投保", "健康承保", "健康保险", "健康续保", "健康综合险", "健康综合保险", "健康一切险", "健康一切保险", "健康一揽子保险", "健康保障计划", "伤害险", "伤害投保", "伤害承保", "伤害保险", "伤害续保", "伤害综合险", "伤害综合保险", "伤害一切险", "伤害一切保险", "伤害一揽子保险", "伤害保障计划", "大病险", "大病投保", "大病承保", "大病保险", "大病续保", "大病综合险", "大病综合保险", "大病一切险", "大病一切保险", "大病一揽子保险", "大病保障计划", "住院险", "住院投保", "住院承保", "住院保险", "住院续保", "住院综合险", "住院综合保险", "住院一切险", "住院一切保险", "住院一揽子保险", "住院保障计划", "死亡险", "死亡投保", "死亡承保", "死亡保险", "死亡续保", "死亡综合险", "死亡综合保险", "死亡一切险", "死亡一切保险", "死亡一揽子保险", "死亡保障计划", "护理险", "护理投保", "护理承保", "护理保险", "护理续保", "护理综合险", "护理综合保险", "护理一切险", "护理一切保险", "护理一揽子保险", "护理保障计划", "医疗补充险", "医疗补充投保", "医疗补充承保", "医疗补充保险", "医疗补充续保", "医疗补充综合险", "医疗补充综合保险", "医疗补充一切险", "医疗补充一切保险", "医疗补充一揽子保险", "医疗补充保障计划", "长期护理险", "长期护理投保", "长期护理承保", "长期护理保险", "长期护理续保", "长期护理综合险", "长期护理综合保险", "长期护理一切险", "长期护理一切保险", "长期护理一揽子保险", "长期护理保障计划", "重大疾病险", "重大疾病投保", "重大疾病承保", "重大疾病保险", "重大疾病续保", "重大疾病综合险", "重大疾病综合保险", "重大疾病一切险", "重大疾病一切保险", "重大疾病一揽子保险", "重大疾病保障计划", "医疗险", "医疗投保", "医疗承保", "医疗保险", "医疗续保", "医疗综合险", "医疗综合保险", "医疗一切险", "医疗一切保险", "医疗一揽子保险", "医疗保障计划", "身故险", "身故投保", "身故承保", "身故保险", "身故续保", "身故综合险", "身故综合保险", "身故一切险", "身故一切保险", "身故一揽子保险", "身故保障计划", "重疾险", "重疾投保", "重疾承保", "重疾保险", "重疾续保", "重疾综合险", "重疾综合保险", "重疾一切险", "重疾一切保险", "重疾一揽子保险", "重疾保障计划", "疾病险", "疾病投保", "疾病承保", "疾病保险", "疾病续保", "疾病综合险", "疾病综合保险", "疾病一切险", "疾病一切保险", "疾病一揽子保险", "疾病保障计划", "骨折险", "骨折投保", "骨折承保", "骨折保险", "骨折续保", "骨折综合险", "骨折综合保险", "骨折一切险", "骨折一切保险", "骨折一揽子保险", "骨折保障计划", "跌落险", "跌落投保", "跌落承保", "跌落保险", "跌落续保", "跌落综合险", "跌落综合保险", "跌落一切险", "跌落一切保险", "跌落一揽子保险", "跌落保障计划", "养老险", "养老投保", "养老承保", "养老保险", "养老续保", "养老综合险", "养老综合保险", "养老一切险", "养老一切保险", "养老一揽子保险", "养老保障计划", "巨灾险", "巨灾投保", "巨灾承保", "巨灾保险", "巨灾续保", "巨灾综合险", "巨灾综合保险", "巨灾一切险", "巨灾一切保险", "巨灾一揽子保险", "巨灾保障计划", "伤残补偿险", "伤残补偿投保", "伤残补偿承保", "伤残补偿保险", "伤残补偿续保", "伤残补偿综合险", "伤残补偿综合保险", "伤残补偿一切险", "伤残补偿一切保险", "伤残补偿一揽子保险", "伤残补偿保障计划", "爆炸险", "爆炸投保", "爆炸承保", "爆炸保险", "爆炸续保", "爆炸综合险", "爆炸综合保险", "爆炸一切险", "爆炸一切保险", "爆炸一揽子保险", "爆炸保障计划"};
    /**
     * 保险-通用
     */
    private static final String[] F = {"责任险", "责任投保", "责任承保", "责任保险", "责任续保", "责任综合险", "责任综合保险", "责任一切险", "责任一切保险", "责任一揽子保险", "责任保障计划", "营运险", "营运投保", "营运承保", "营运保险", "营运续保", "营运综合险", "营运综合保险", "营运一切险", "营运一切保险", "营运一揽子保险", "营运保障计划", "货运险", "货运投保", "货运承保", "货运保险", "货运续保", "货运综合险", "货运综合保险", "货运一切险", "货运一切保险", "货运一揽子保险", "货运保障计划", "雇主险", "雇主投保", "雇主承保", "雇主保险", "雇主续保", "雇主综合险", "雇主综合保险", "雇主一切险", "雇主一切保险", "雇主一揽子保险", "雇主保障计划", "综合险", "综合投保", "综合承保", "综合保险", "综合续保", "综合综合险", "综合综合保险", "综合一切险", "综合一切保险", "综合一揽子保险", "综合保障计划", "一切险", "一切投保", "一切承保", "一切保险", "一切续保", "一切综合险", "一切综合保险", "一切一切险", "一切一切保险", "一切一揽子保险", "一切保障计划", "一揽子险", "一揽子投保", "一揽子承保", "一揽子保险", "一揽子续保", "一揽子综合险", "一揽子综合保险", "一揽子一切险", "一揽子一切保险", "一揽子一揽子保险", "一揽子保障计划", "商业险", "商业投保", "商业承保", "商业保险", "商业续保", "商业综合险", "商业综合保险", "商业一切险", "商业一切保险", "商业一揽子保险", "商业保障计划", "培训险", "培训投保", "培训承保", "培训保险", "培训续保", "培训综合险", "培训综合保险", "培训一切险", "培训一切保险", "培训一揽子保险", "培训保障计划", "农业险", "农业投保", "农业承保", "农业保险", "农业续保", "农业综合险", "农业综合保险", "农业一切险", "农业一切保险", "农业一揽子保险", "农业保障计划", "民警险", "民警投保", "民警承保", "民警保险", "民警续保", "民警综合险", "民警综合保险", "民警一切险", "民警一切保险", "民警一揽子保险", "民警保障计划", "人群险", "人群投保", "人群承保", "人群保险", "人群续保", "人群综合险", "人群综合保险", "人群一切险", "人群一切保险", "人群一揽子保险", "人群保障计划", "住房险", "住房投保", "住房承保", "住房保险", "住房续保", "住房综合险", "住房综合保险", "住房一切险", "住房一切保险", "住房一揽子保险", "住房保障计划", "畜牧业险", "畜牧业投保", "畜牧业承保", "畜牧业保险", "畜牧业续保", "畜牧业综合险", "畜牧业综合保险", "畜牧业一切险", "畜牧业一切保险", "畜牧业一揽子保险", "畜牧业保障计划", "灾毁险", "灾毁投保", "灾毁承保", "灾毁保险", "灾毁续保", "灾毁综合险", "灾毁综合保险", "灾毁一切险", "灾毁一切保险", "灾毁一揽子保险", "灾毁保障计划", "工人险", "工人投保", "工人承保", "工人保险", "工人续保", "工人综合险", "工人综合保险", "工人一切险", "工人一切保险", "工人一揽子保险", "工人保障计划", "保障险", "保障投保", "保障承保", "保障保险", "保障续保", "保障综合险", "保障综合保险", "保障一切险", "保障一切保险", "保障一揽子保险", "保障保障计划", "建工险", "建工投保", "建工承保", "建工保险", "建工续保", "建工综合险", "建工综合保险", "建工一切险", "建工一切保险", "建工一揽子保险", "建工保障计划", "种植险", "种植投保", "种植承保", "种植保险", "种植续保", "种植综合险", "种植综合保险", "种植一切险", "种植一切保险", "种植一揽子保险", "种植保障计划", "森林险", "森林投保", "森林承保", "森林保险", "森林续保", "森林综合险", "森林综合保险", "森林一切险", "森林一切保险", "森林一揽子保险", "森林保障计划", "扶贫险", "扶贫投保", "扶贫承保", "扶贫保险", "扶贫续保", "扶贫综合险", "扶贫综合保险", "扶贫一切险", "扶贫一切保险", "扶贫一揽子保险", "扶贫保障计划", "自然灾害险", "自然灾害投保", "自然灾害承保", "自然灾害保险", "自然灾害续保", "自然灾害综合险", "自然灾害综合保险", "自然灾害一切险", "自然灾害一切保险", "自然灾害一揽子保险", "自然灾害保障计划", "农产品险", "农产品投保", "农产品承保", "农产品保险", "农产品续保", "农产品综合险", "农产品综合保险", "农产品一切险", "农产品一切保险", "农产品一揽子保险", "农产品保障计划", "保健险", "保健投保", "保健承保", "保健保险", "保健续保", "保健综合险", "保健综合保险", "保健一切险", "保健一切保险", "保健一揽子保险", "保健保障计划", "运营期险", "运营期投保", "运营期承保", "运营期保险", "运营期续保", "运营期综合险", "运营期综合保险", "运营期一切险", "运营期一切保险", "运营期一揽子保险", "运营期保障计划", "安全生产险", "安全生产投保", "安全生产承保", "安全生产保险", "安全生产续保", "安全生产综合险", "安全生产综合保险", "安全生产一切险", "安全生产一切保险", "安全生产一揽子保险", "安全生产保障计划", "综治险", "综治投保", "综治承保", "综治保险", "综治续保", "综治综合险", "综治综合保险", "综治一切险", "综治一切保险", "综治一揽子保险", "综治保障计划", "治安险", "治安投保", "治安承保", "治安保险", "治安续保", "治安综合险", "治安综合保险", "治安一切险", "治安一切保险", "治安一揽子保险", "治安保障计划", "农房险", "农房投保", "农房承保", "农房保险", "农房续保", "农房综合险", "农房综合保险", "农房一切险", "农房一切保险", "农房一揽子保险", "农房保障计划", "旅游险", "旅游投保", "旅游承保", "旅游保险", "旅游续保", "旅游综合险", "旅游综合保险", "旅游一切险", "旅游一切保险", "旅游一揽子保险", "旅游保障计划", "境外留学险", "境外留学投保", "境外留学承保", "境外留学保险", "境外留学续保", "境外留学综合险", "境外留学综合保险", "境外留学一切险", "境外留学一切保险", "境外留学一揽子保险", "境外留学保障计划", "境外工作险", "境外工作投保", "境外工作承保", "境外工作保险", "境外工作续保", "境外工作综合险", "境外工作综合保险", "境外工作一切险", "境外工作一切保险", "境外工作一揽子保险", "境外工作保障计划", "自助游险", "自助游投保", "自助游承保", "自助游保险", "自助游续保", "自助游综合险", "自助游综合保险", "自助游一切险", "自助游一切保险", "自助游一揽子保险", "自助游保障计划", "旅行险", "旅行投保", "旅行承保", "旅行保险", "旅行续保", "旅行综合险", "旅行综合保险", "旅行一切险", "旅行一切保险", "旅行一揽子保险", "旅行保障计划", "家庭险", "家庭投保", "家庭承保", "家庭保险", "家庭续保", "家庭综合险", "家庭综合保险", "家庭一切险", "家庭一切保险", "家庭一揽子保险", "家庭保障计划", "家庭出行险", "家庭出行投保", "家庭出行承保", "家庭出行保险", "家庭出行续保", "家庭出行综合险", "家庭出行综合保险", "家庭出行一切险", "家庭出行一切保险", "家庭出行一揽子保险", "家庭出行保障计划", "老年人险", "老年人投保", "老年人承保", "老年人保险", "老年人续保", "老年人综合险", "老年人综合保险", "老年人一切险", "老年人一切保险", "老年人一揽子保险", "老年人保障计划", "女性关爱险", "女性关爱投保", "女性关爱承保", "女性关爱保险", "女性关爱续保", "女性关爱综合险", "女性关爱综合保险", "女性关爱一切险", "女性关爱一切保险", "女性关爱一揽子保险", "女性关爱保障计划", "航旅综合保障险", "航旅综合保障投保", "航旅综合保障承保", "航旅综合保障保险", "航旅综合保障续保", "航旅综合保障综合险", "航旅综合保障综合保险", "航旅综合保障一切险", "航旅综合保障一切保险", "航旅综合保障一揽子保险", "航旅综合保障保障计划", "儿童预防接种险", "儿童预防接种投保", "儿童预防接种承保", "儿童预防接种保险", "儿童预防接种续保", "儿童预防接种综合险", "儿童预防接种综合保险", "儿童预防接种一切险", "儿童预防接种一切保险", "儿童预防接种一揽子保险", "儿童预防接种保障计划", "自驾游险", "自驾游投保", "自驾游承保", "自驾游保险", "自驾游续保", "自驾游综合险", "自驾游综合保险", "自驾游一切险", "自驾游一切保险", "自驾游一揽子保险", "自驾游保障计划", "商务出行险", "商务出行投保", "商务出行承保", "商务出行保险", "商务出行续保", "商务出行综合险", "商务出行综合保险", "商务出行一切险", "商务出行一切保险", "商务出行一揽子保险", "商务出行保障计划", "境内高原游险", "境内高原游投保", "境内高原游承保", "境内高原游保险", "境内高原游续保", "境内高原游综合险", "境内高原游综合保险", "境内高原游一切险", "境内高原游一切保险", "境内高原游一揽子保险", "境内高原游保障计划", "代步工具组合险", "代步工具组合投保", "代步工具组合承保", "代步工具组合保险", "代步工具组合续保", "代步工具组合综合险", "代步工具组合综合保险", "代步工具组合一切险", "代步工具组合一切保险", "代步工具组合一揽子保险", "代步工具组合保障计划", "滑雪运动险", "滑雪运动投保", "滑雪运动承保", "滑雪运动保险", "滑雪运动续保", "滑雪运动综合险", "滑雪运动综合保险", "滑雪运动一切险", "滑雪运动一切保险", "滑雪运动一揽子保险", "滑雪运动保障计划", "雇员忠诚险", "雇员忠诚投保", "雇员忠诚承保", "雇员忠诚保险", "雇员忠诚续保", "雇员忠诚综合险", "雇员忠诚综合保险", "雇员忠诚一切险", "雇员忠诚一切保险", "雇员忠诚一揽子保险", "雇员忠诚保障计划", "学生险", "学生投保", "学生承保", "学生保险", "学生续保", "学生综合险", "学生综合保险", "学生一切险", "学生一切保险", "学生一揽子保险", "学生保障计划", "盗抢险", "盗抢投保", "盗抢承保", "盗抢保险", "盗抢续保", "盗抢综合险", "盗抢综合保险", "盗抢一切险", "盗抢一切保险", "盗抢一揽子保险", "盗抢保障计划", "自燃险", "自燃投保", "自燃承保", "自燃保险", "自燃续保", "自燃综合险", "自燃综合保险", "自燃一切险", "自燃一切保险", "自燃一揽子保险", "自燃保障计划", "涉水险", "涉水投保", "涉水承保", "涉水保险", "涉水续保", "涉水综合险", "涉水综合保险", "涉水一切险", "涉水一切保险", "涉水一揽子保险", "涉水保障计划", "抢劫险", "抢劫投保", "抢劫承保", "抢劫保险", "抢劫续保", "抢劫综合险", "抢劫综合保险", "抢劫一切险", "抢劫一切保险", "抢劫一揽子保险", "抢劫保障计划", "燃气险", "燃气投保", "燃气承保", "燃气保险", "燃气续保", "燃气综合险", "燃气综合保险", "燃气一切险", "燃气一切保险", "燃气一揽子保险", "燃气保障计划", "救援险", "救援投保", "救援承保", "救援保险", "救援续保", "救援综合险", "救援综合保险", "救援一切险", "救援一切保险", "救援一揽子保险", "救援保障计划", "定点险", "定点投保", "定点承保", "定点保险", "定点续保", "定点综合险", "定点综合保险", "定点一切险", "定点一切保险", "定点一揽子保险", "定点保障计划", "定期险", "定期投保", "定期承保", "定期保险", "定期续保", "定期综合险", "定期综合保险", "定期一切险", "定期一切保险", "定期一揽子保险", "定期保障计划", "全损险", "全损投保", "全损承保", "全损保险", "全损续保", "全损综合险", "全损综合保险", "全损一切险", "全损一切保险", "全损一揽子保险", "全损保障计划", "修理险", "修理投保", "修理承保", "修理保险", "修理续保", "修理综合险", "修理综合保险", "修理一切险", "修理一切保险", "修理一揽子保险", "修理保障计划"};
    /**
     * 黑词
     */
    private static final String[] X = {"保险基金会", "保险走进扶贫车间", "保险事业管理所", "保险协议服务机构", "保险手机客户端", "保险业监督管理委员会", "银行保险监督管理", "保险业务信息系统", "保险植被恢复", "车险服务记录仪", "保险接续网络系统", "保险统保平台", "裸机+保险", "健康险服务预约平台", "保险“一站式”结算系统", "保险服务大楼", "保险应保尽保有关问题", "保险小镇", "保险监督管理委员会", "财险大厦", "养老保险系统", "保险经办服务中心", "保险实验室", "保险待遇测算服务平台", "保险协议服务机构联网结算接口", "保险综合业务和数据分析应用", "保险网上办事信息系统", "森林保险植被恢复", "保险费信息共享平台", "保险行业投诉产品", "保险公寓", "保险信息共享平台", "保险基金财务管理系统", "健康险理赔风控系统", "平安财险大厦", "车险承保理赔系统", "保险综合柜员制", "保险事业所", "保险办公设备", "养老保险子系统", "保险环", "保险资产管理有限公司", "保险事业管理局", "保险整合重建项目", "养老保险待遇领取资格", "保险系统", "保险失能等级评估", "保险管理局", "保险软件系统", "保险创新综合试验区", "双大钩双保险", "保险工作管理平台", "下仓保险", "跌落保险", "保险广告服务", "保险业务经办大厅", "保险单证", "保险板件", "跌落式保险", "平安保险楼", "保险软件", "保险事业单位管理局", "保险基金支出账户", "保险待遇表格", "无人机第三者保险", "保险费申报测算系统", "保险+思想峰会", "保险及房屋使用", "人保车险热线", "保险操作平台", "保险功能上线", "保险档案封面", "保险熔管", "保险医保办事机构光纤数据", "保险与股权资产托管系统", "工伤保险新系统", "养老保险待遇测算", "保险理赔单据信息录入", "保险费子系统", "保险补贴项目", "保险业务信息平台", "驱动器保险", "保险股份有限公司", "横琴保险", "中国人寿财险", "中国人寿保险", "保险经纪有限公司", "中国人民财产保险", "人保财险", "英大保险", "英大长安保险", "信用保险公司", "国寿财险", "保险公司", "人寿保险股份", "诚泰财产保险", "诚至诚保险", "中国太平洋保险", "中国人保财险", "保险有限公司", "养老保险管理中心", "养老保险中心", "养老保险事业管理", "保险基金管理局", "保险丝", "保险杯", "信息系统", "信息平台", "医疗保障局"};
}
