package com.qianlima.offline.service;

import com.qianlima.offline.bean.Area;
import com.qianlima.offline.bean.NoticeMQ;
import com.qianlima.offline.middleground.NotBaiLianZhongTaiService;
import com.qianlima.offline.util.ContentSolr;
import lombok.extern.slf4j.Slf4j;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.beans.factory.annotation.Qualifier;
import org.springframework.jdbc.core.JdbcTemplate;
import org.springframework.stereotype.Service;

import javax.annotation.PostConstruct;
import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;
import java.util.concurrent.ExecutionException;
import java.util.concurrent.ExecutorService;
import java.util.concurrent.Executors;
import java.util.concurrent.Future;

@Service
@Slf4j
public class BoKeService02 {

    @Autowired
    private ContentSolr contentSolr;

    @Autowired
    @Qualifier("gwJdbcTemplate")
    private JdbcTemplate gwJdbcTemplate;

    @Autowired
    private NotBaiLianZhongTaiService zhongTaiService;

    HashMap<Integer, Area> areaMap =  new HashMap<>();

    @PostConstruct
    public void init() {
        List<Map<String, Object>> maps = gwJdbcTemplate.queryForList("SELECT * FROM phpcms_area");
        for (Map<String, Object> map : maps) {
            Area area = new Area();
            area.setAreaid(Integer.valueOf(map.get("areaid").toString()));
            area.setName(map.get("name").toString());
            area.setParentid(map.get("parentid").toString());
            area.setArrparentid(map.get("arrparentid").toString());
            areaMap.put(Integer.valueOf(map.get("areaid").toString()),area);
        }
    }

    public void getSolrAllField() throws Exception{

        ExecutorService executorService1 = Executors.newFixedThreadPool(32);
        List<NoticeMQ> list = new ArrayList<>();
        List<NoticeMQ> list1 = new ArrayList<>();
        HashMap<String, String> dataMap = new HashMap<>();
        List<Future> futureList1 = new ArrayList<>();


        String[] aas = { "医用x光机", "医用离心机", "医用制氧机", "医用雾化器", "医用显示器", "医用床", "医用病床", "医用吊塔", "医用护理床", "医用夹板", "医用胶片", "医用门", "简易呼吸机", "新生儿呼吸机", "正压呼吸机", "双水平呼吸机", "进口呼吸机", "洗胃机", "全自动洗胃机", "胃肠机", "自动洗胃机", "电子胃镜", "胃肠镜", "超声胃镜", "胃镜", "鼻胃管", "心电图机", "心脏起搏器", "心电仪", "心电图仪", "胎心监护仪", "心导管", "中心静脉置管", "超声心动图", "有创呼吸机", "无创呼吸机", "呼吸麻醉机", "外科手术器械", "手术器", "手术室器械", "手术显微镜", "输尿管镜手术", "手术室设备", "手术无影灯", "手术灯", "手术床", "电动手术床", "电动手术台", "手术车", "手术包", "手术钳", "血压传感器", "止血器", "血球仪", "血细胞分析仪", "血球分析仪", "血球计数仪", "血凝仪", "血气分析仪", "血凝分析仪", "血沉仪", "血压监测仪", "全自动血凝仪", "血氧检测仪", "血压监护仪", "脉搏血氧仪", "血氧仪", "动态血压仪", "血氧饱和度仪", "血压测量仪", "血糖检测仪", "血管钳", "真空采血管", "超声止血刀", "电子血压计", "全自动血压计", "脉搏波血压计", "血液透析机", "血液回收机", "血液透析器", "血液分析仪", "晨检仪", "治疗仪", "输液泵", "MR", "静脉输液泵", "牵引床", "妇科检查床", "自控镇痛泵", "多功能产床", "医疗床", "牙科椅", "治疗台", "注射泵", "双极电凝镊", "康复理疗设备", "放疗设备", "牙科治疗椅", "牙科x光机", "数字x光机", "血透机", "治疗机", "透析机", "便携式x光机", "蜡疗机", "CT机", "膨宫机", "中药熏蒸机", "动物麻醉机", "排痰机", "体外碎石机", "造影机", "超声清洗机", "血管造影机", "便携式b超机", "病理切片机", "超声波洁牙机", "数字乳腺机", "胶囊填充机", "除颤器", "临时起搏器", "起搏器", "手术器械", "电动吸痰器", "icd起搏器", "穿刺器", "医院病床", "急救担架", "刺激器", "aed除颤仪", "除颤仪", "电除颤仪", "除颤监护仪", "超声波治疗仪", "冲击波治疗仪", "超声治疗仪", "超短波治疗仪", "臭氧治疗仪", "超声探伤仪", "tdp治疗仪", "艾灸治疗仪", "比浊仪", "超声内镜", "鼻内镜", "电耳镜", "鼻氧管", "病床", "产床", "b超探头", "mr核磁共振", "便携式彩超", "妇科治疗仪", "电刺激器", "激光美容仪器", "光子治疗仪", "黄疸治疗仪", "红外线治疗仪", "光子嫩肤仪", "红蓝光治疗仪", "红光治疗仪", "毫米波治疗仪", "激光理疗仪", "妇科腹腔镜", "喉镜", "电动护理床", "喉罩", "加药计量泵", "微波治疗仪器", "口腔器械", "阴道扩张器", "胰岛素注射器", "疼痛治疗仪", "微波治疗仪", "神灯治疗仪", "电针治疗仪", "电灼光治疗仪", "脂肪测定仪", "深部热疗仪", "诊断仪", "肛肠治疗仪", "电子阴道镜", "经皮镜", "肛肠镜", "经皮肾镜", "电子肛门镜", "电子喉镜", "支气管镜", "椎间孔镜", "支气管纤维镜", "电子肠镜", "乙状结肠镜", "角膜镜", "角塑镜", "结肠镜", "阴道镜", "一次性导尿管", "电子镇痛泵", "解剖台", "止痛泵", "腔镜", "管镜", "耳镜", "胃管", "监护仪", "呼吸机", "麻醉机", "细胞仪", "凝血剂", "黑白超", "x光机", "牵引机", "理疗灯", "导药仪", "输液器", "氧合器", "吸痰器", "持针器", "康复器", "超声仪", "电泳仪", "蜡疗仪", "脉氧仪", "集菌仪", "氮吹仪", "膨宫仪", "电切镜", "膀胱镜", "纤支镜", "耳内镜", "乳腔镜", "食管镜", "涎腺镜", "肾软镜", "输液管", "插尿管", "肾小管", "氩气刀", "膨宫泵", "电凝刀", "输液椅", "膜片钳", "多勒普", "持针钳", "氩氦刀", "人造骨", "氮气计", "肺量仪", "大肠镜", "子宫镜", "直肠镜", "羊水镜", "磁疗机", "脉象仪", "舌相仪", "电麻仪", "酶免仪", "染色机", "包埋机", "采血针", "采血笔", "助听器", "灌肠机", "洗肠机", "矫治器", "骨水泥", "鼻饲管", "肛门管", "肛门袋", "集尿袋", "引流袋", "洗耳球", "舌象仪", "导尿管", "生化试剂", "尿液分析", "黑白超声", "超声附件", "兽用监护", "兽用超声", "血液细胞", "呼吸面罩", "康复器械", "骨密度仪", "肺功能仪", "透光率仪", "消化内镜", "麻醉喉镜", "输尿管镜", "膝关节镜", "透射电镜", "胶囊内镜", "气管插管", "静脉置管", "食管支架", "超声设备", "康复设备", "超声骨刀", "医学影像", "脑电图机", "脑电阻仪", "肌电图机", "眼动图仪", "心音图仪", "舌音图仪", "胃电图仪", "视网膜镜", "屈光度仪", "手术电极", "防打鼾器", "磁疗器具", "肾功能仪", "心功能仪", "防护眼镜", "血流变仪", "PACS", "彩色多普勒", "x光透视机", "凯氏定氮仪", "低速离心机", "超速离心机", "简易呼吸器", "空气消毒器", "雾化吸入器", "精密输液器", "腰椎牵引器", "超声雾化器", "皮肤缝合器", "生物传感器", "超声波仪器", "超声清洗器", "菌落计数器", "测温传感器", "颈椎牵引器", "流式细胞仪", "尿液分析仪", "射频治疗仪", "离子色谱仪", "微波消解仪", "胎儿监护仪", "微波理疗仪", "温度校验仪", "核磁共振仪", "恒温混匀仪", "母乳分析仪", "x光检测仪", "余氯分析仪", "拉曼光谱仪", "多肽合成仪", "输尿管软镜", "电子显微镜", "硅胶导尿管", "深静脉置管", "输尿管导管", "三腔导尿管", "经颅多普勒", "腰椎牵引床", "静脉推注泵", "颈椎牵引椅", "防褥疮床垫", "骨科牵引架", "超声波探头", "心电分析仪", "心电遥测仪", "心电工作站", "脑地形图仪", "眼震电图仪", "小儿测听计", "病人监护仪", "血氧饱和度", "分娩监护仪", "脑血流图仪", "方波生理仪", "阴道显微镜", "直肠显微镜", "医用放大镜", "超声听诊器", "超声去脂仪", "超声治疗机", "超声按摩仪", "超声洁牙机", "激光诊断仪", "激光检测仪", "短波治疗机", "音频电疗机", "差频电疗机", "光谱治疗仪", "骨科牵引器", "心率反馈仪", "视力训练仪", "弱视治疗仪", "痛阈测量仪", "经络分析仪", "综合电针仪", "定量针麻仪", "电动导管床", "电动断层床", "高压注射器", "核素听诊器", "半自动血栓", "血糖分析仪", "血液粘度计", "血栓弹力仪", "生化分析仪", "细胞电泳仪", "血气采血器", "精子分析仪", "血球记数板", "高速离心机", "激光采血机", "腹膜透析机", "腹膜透析管", "流产吸引器", "治疗手术床", "电动洗胃机", "自控洗胃机", "胃脏冲洗器", "手术照明灯", "手术反光灯", "骨科整形床", "综合治疗台", "电动牙钻机", "涡轮牙钻机", "液压牙科椅", "机械牙科椅", "医用洁牙机", "根管治疗仪", "强力吸引器", "医用空压机", "牙模测试仪", "银汞调和器", "口腔手术灯", "口腔照明灯", "吸氧调节器", "手摇式病床", "干热灭菌器", "微波灭菌柜", "煮沸消毒器", "液氮冷疗机", "皮肤缝合钉", "胆管引流管", "支气管插管", "十二指肠管", "阴道洗涤器", "骨膜剥离器", "单腔导尿管", "麻醉呼吸机", "数字化手术室", "生化免疫分析", "超声波清洗机", "实验室离心机", "原子力显微镜", "手持式显微镜", "紫外线杀菌灯", "led轨道灯", "紫外线灭菌灯", "等离子切割器", "微量氧分析仪", "超声波清洗仪", "紫外线光疗仪", "紫外线治疗仪", "x射线检测仪", "浮游菌采样器", "电解质分析仪", "肺功能检测仪", "肺功能测试仪", "毛细管电泳仪", "多参数监护仪", "光化学反应仪", "骨密度检测仪", "颅内压监测仪", "尿沉渣分析仪", "脑立体定位仪", "红外线理疗仪", "氦质谱检漏仪", "多功能艾灸仪", "纤维支气管镜", "裂隙灯显微镜", "气管插管喉镜", "便携式显微镜", "电泳涂装设备", "多功能护理床", "感染实时监控", "数字放射成像", "单导心电图机", "多导心电图机", "胎儿心电图机", "心电向量图机", "晚电位测试仪", "心电标测图仪", "脑电波分析仪", "视网膜电图仪", "胃肠电流图仪", "氧浓度测定仪", "阻抗血流图仪", "电磁血流量计", "微电极控制器", "微电极监视器", "角膜地形图仪", "电弱视助视器", "微循环显微镜", "裂隙灯工作台", "视野计工作台", "超声骨密度仪", "超声骨强度仪", "超声骨测量仪", "超短波治疗机", "场效应治疗仪", "紫外线治疗机", "红外线治疗机", "简易防打鼾器", "磁感应电疗机", "X射线CT管", "电动摄影平床", "防散射滤线栅", "荧光摄影装置", "胸片摄影装置", "伽玛照相机", "γ射线探测仪", "性腺防护器具", "X射线防护椅", "全自动涂片机", "血小板聚集仪", "红细胞变形仪", "半自动酶标仪", "全自动电泳仪", "中高压电泳仪", "电化学测氧仪", "PCR扩增仪", "厌氧培养装置", "红白血球吸管", "血液净化管路", "输卵管通气机", "电动牙科椅", "氧浓度监察仪", "氧气减压装置", "超声消毒设备", "脏器冷藏装置", "牙釉质粘合剂", "齿科铸造合金", "齿科锻造合金", "方丝弓矫治器", "细丝弓矫治器", "气管切开插管", "无菌医用手套", "颈椎直角骨凿", "治疗X射线机", "心功能检测仪", "栅极X射线管", "床旁输液工作站", "超高效液相色谱", "运动心电功量计", "心电多相分析仪", "长程心电记录仪", "麻醉气体监护仪", "呼吸功能监护仪", "呼吸功能测试仪", "弥散功能测试仪", "微量气体分析器", "无创心输出量计", "电子血压脉搏仪", "动态血压监护仪", "医用红外热象仪", "夜间视觉检查仪", "前房深度测定仪", "各类手术显微镜", "各种手术放大镜", "胎儿综合监护仪", "超声产科监护仪", "穿刺超声换能器", "电子线阵换能器", "机械扫描换能器", "凸阵扫描换能器", "食管超声换能器", "超声穴位治疗机", "超声骨折治疗机", "激光血管焊接机", "激光血液分析仪", "氦氖激光治疗机", "氦镉激光治疗机", "激光针灸治疗仪", "高频腋臭治疗仪", "高频痔疮治疗仪", "高频妇科电熨器", "强光辐射治疗仪", "胸背部矫正装置", "肌电生物反馈仪", "温度生物反馈仪", "耳穴探测治疗机", "X射线像增强器", "医用透视荧光屏", "X射线摄影暗匣", "X射线暗室设备", "闪烁分层摄影仪", "放射免疫测定仪", "血红蛋白测定仪", "流式细胞分析仪", "特定蛋白分析仪", "化学发光测定仪", "荧光免疫分析仪", "快速细菌培养仪", "血气酸碱分析仪", "生物芯片阅读仪", "冷冻超速离心机", "血型专用离心机", "冷冻高速离心机", "自动组织脱水机", "电动综合手术台", "电动间隙牵引床", "各种胃肠减压器", "牙髓活力测试仪", "吸排氧三通阀箱", "电动多功能病床", "口腔科消毒设备", "电热煮沸消毒器", "冷冻低温治疗机", "低温变速降温仪", "低温生物降温仪", "血液制品冷藏箱", "冷冻干燥血浆机", "真空冷冻干燥箱", "氧化锌印模糊剂", "双腔气囊导尿管", "麻醉机用呼吸囊", "椎体前方剥离器", "心电图综合测试仪", "心率变异性检测仪", "综合肺功能测定仪", "肺通气功能测试仪", "生物电脉冲分析仪", "红外线乳腺诊断仪", "直接和间接检眼镜", "体表微循环显微镜", "多功能超声监护仪", "血管内超声换能器", "B型伪彩色显示仪", "激光多普勒血流计", "半导体激光治疗机", "高频五官科电熨器", "特定电磁波治疗机", "中低频理疗用电极", "旋转阳极X射线管", "甲状腺功能测定仪", "放射性核素透视机", "全自动生化分析仪", "半自动生化分析仪", "多项电解质分析仪", "全自动血气分析仪", "组织氧含量测定仪", "血氧饱和度测试仪", "手提式氧气吸入器", "手提式氧气发生器", "牙根管长度测定仪", "预真空蒸汽灭菌器", "超声干燥脱水设备", "宫腔冷冻治疗仪", "压缩式冷冻治疗仪", "数字化超声工作站", "太行血液分析流水线", "糖化血红蛋白分析仪", "实时心律分析记录仪", "脑电实时分析记录仪", "眼晶体激光乳化设备", "激光荧光肿瘤诊断仪", "高压低频脉冲治疗机", "低频电磁综合治疗机", "电子穴位测定治疗仪", "医用间接摄影荧光屏", "电动立柱式支撑装置", "全自动血细胞分析仪", "半自动血细胞分析仪", "血液流变参数测试仪", "幽门螺旋杆菌测定仪", "经皮血氧分压监测仪", "耳鼻喉科检查治疗台", "医用伽玛射线灭菌器", "自动高压蒸汽灭菌器", "立式压力蒸汽灭菌器", "放射性核素治疗装置", "五分类血液细胞分析仪", "三分群血液细胞分析仪", "生物电脉冲频率分析仪", "心腔内超声导管换能器", "超声波妇科皮肤治疗仪", "激光肿瘤光谱诊断装置", "探穴针麻机穴位测试仪", "医用固定阳极X射线管", "X射线胶片自动冲洗机", "全自动凝血纤溶分析仪", "自动尿液分析仪及试纸", "手提式压力蒸汽灭菌器", "轻便型自动气体灭菌器", "X射线计算机断层摄影", "全自动干化学尿液分析仪", "肺内气体分布功能测试仪", "心脏血管功能综合测试仪", "B型电子线阵超声诊断仪", "B型机械扇扫超声诊断仪", "角膜板层刀", "X射线检查用电动胃肠床", "放射性同位素设备准直器", "X射线防护屏等防护装置", "全自动多项电解质分析仪", "医用冷光纤维导光手术灯", "卧式圆形压力蒸汽灭菌器", "卧式矩形压力蒸汽灭菌器", "脉动真空压力蒸汽灭菌器", "病房用高压电离灭菌设备", "自动控制电热煮沸消毒器", "激光视网膜传递函数测定仪", "手术室用高压电离灭菌设备", "辐射治疗机常规光源治疗机", "全自动化学发光免疫分析仪", "手术刀", "皮片刀", "疣体剥离刀", "剃毛刀", "皮屑刮刀", "解剖刀", "普通手术剪", "组织剪", "综合组织剪", "拆线剪", "石膏剪", "解剖剪", "纱布绷带剪", "教育用手术剪", "普通止血钳", "小血管止血钳", "蚊式止血钳", "组织钳", "硬质合金镶片持针钳", "普通持针钳", "创夹缝拆钳", "皮肤轧钳", "子弹钳", "纱布剥离钳", "海绵钳", "帕巾钳", "皮管钳", "器械钳", "小血管镊", "无损伤镊", "组织镊", "整形镊", "持针镊", "保健镊", "拔毛镊", "帕巾镊", "敷料镊", "解剖镊", "止血夹", "动脉瘤针", "探针", "推毛针", "植毛针", "挑针", "教学用直尖针", "静脉拉钩", "创口钩", "扁平拉钩", "双头拉钩", "皮肤拉钩", "解剖钩", "刀片夹持器", "麻醉口罩", "麻醉开口器", "照明吸引器头", "粉刺取出器", "黑头粉刺压出器", "皮肤刮匙", "皮肤套刮器", "皮肤刮划测检器", "皮肤检查尺", "皮肤组织钻孔器", "开口器", "卷棉子", "显微喉刀", "显微剪", "显微枪形手术剪", "显微组织剪", "显微枪形麦粒钳", "显微喉钳", "显微持针钳", "显微镊", "显微持针镊", "显微止血夹", "显微耳针", "显微喉针", "显微耳钩", "显微喉钩", "显微合拢器", "脑神经刀", "可拆卸式脑膜刀", "脑膜刀", "肿瘤摘除钳", "脑组织咬除钳", "U型夹钳", "动脉瘤夹钳", "脑膜镊", "垂体瘤镊", "肿瘤夹持镊", "脑膜钩", "脑膜拉钩", "神经钩", "神经根拉钩", "交感神经钩", "脑刮匙", "脑垂体刮匙", "脑活检抽吸器", "脑膜剥离器", "脑吸引器", "后颅凹牵开器", "手摇颅骨钻", "脑打针锤", "脑压板", "角膜剪", "眼用手术剪", "眼用组织剪", "晶体植入钳", "环状组织钳", "角膜镊", "眼用镊", "眼用结扎镊", "眼用钩针", "眼用板铲", "眼用固定环", "开睑器", "耳鼓膜刀", "鼻粘膜刀", "扁桃体刀", "酒渣鼻切割刀", "鼻骨凿", "乳突平骨凿", "上颌窦对孔凿", "耳用骨凿", "扁桃体剪", "甲状腺剪", "喉头剪", "中耳剪", "鼻剪", "扁桃体止血钳", "枪式间接喉钳", "筛窦钳", "耳钳", "双关节鼻中隔咬骨钳", "甲状腺三爪钳", "鼻咽活体取样钳", "喉用敷料镊", "耳用膝状镊", "鼻用枪状镊", "扁桃体止血夹", "喉部微型手术钩", "耳用探针", "双头鼓式探针", "扁桃体拉钩", "鼻腔拉钩", "扁桃体吸引管", "乳突吸引管", "乳突牵开器", "麻醉咽喉镜", "支撑喉镜", "耳单头刮匙", "音叉", "鼻镜", "牙龈刀", "水门调刀", "粘固粉调刀", "银汞雕刻刀", "牙骨凿", "阻生牙骨凿", "牙釉凿", "牙龈剪", "全冠剪", "拔牙钳", "切断牙钳", "牙槽咬骨钳", "舌钳", "扩大钳", "残根镊", "牙用镊", "长镊", "成形片夹", "牙探针", "脓肿探针", "牙周袋探针", "牙挺", "丁字形牙挺", "牙根尖挺", "牙用锉", "牙骨锤", "牙刮匙", "根管充填器", "牙骨膜分离器", "牙龈分离器", "洁治器", "刮治器", "剔挖器", "研光器", "粘固粉充填器", "银汞合金充填器", "去冠器", "口镜", "拔髓针柄", "水枪头", "热气枪头", "吹火管", "咬合器", "印模托盘", "汞合金输送器", "磨牙带环就位器", "结扎杆", "带环推子", "弓丝成型器", "测量器", "胸骨刀", "心脏手术剪", "胸骨剪", "肋骨剪", "心内膜心肌活组织钳", "心房侧壁钳", "主动脉侧壁钳", "主动脉阻断钳", "主动脉止血钳", "主动脉游离钳", "无损伤肺动脉止血钳", "无损伤动脉止血钳", "无损伤动脉导管钳", "动脉侧壁钳", "动脉阻断钳", "静脉阻断钳", "腔静脉钳", "腔静脉游离钳", "主肺动脉钳", "心房持针钳", "胸腔止血钳", "胸腔组织钳", "三角肺叶钳", "结扎钳", "双关节肋骨咬骨钳", "大隐静脉镊", "心房止血器", "心耳止血器", "凹凸齿止血夹", "胸腔镊", "胸腔组织镊", "肺组织镊", "心房（心室）拉钩", "二尖瓣膜拉钩", "排气针", "血管打洞钳（器）", "心房打洞器", "二尖瓣扩张器", "血管扩张器", "血管牵开器", "胸骨手钻", "双头剥离匙", "肋骨骨膜剥离子", "内膜剥离器", "心内吸引器", "左房引流管", "冠状动脉吸引器", "冠状动脉灌注器", "大隐静脉冲洗管", "静脉撑开器", "短柄吸引器", "胃内手术剪", "直角剪", "胆石钳", "脾蒂钳", "腹膜钳", "胃组织取样钳", "胆道拉钩", "双头腹壁拉钩", "阑尾拉钩", "气腹针", "荷包成型器", "压肠板", "胆石匙", "胆道探条", "腹壁固定牵开器", "肠剪", "膀胱切除剪", "前列腺剪", "血管阻断钳", "骼血管阻断钳", "骼静脉侧壁钳", "肾蒂钳", "肠钳", "直肠活体取样钳", "膀胱肿瘤匙钳", "膀胱颈钳", "痔核钳", "膀胱拉钩", "前列腺拉钩", "肛门探针", "尿道扩张器", "肛门镜", "阴茎夹", "椎管铲刀", "椎管锉刀", "手锥", "丝锥", "髓腔铰刀", "加压螺纹钉铰刀", "截断刀", "截骨刀", "胫骨切刀", "石膏刀", "胫骨切割器", "髋关节成型凹凸钻", "钻头", "铰孔钻", "手枪式手摇骨钻", "双关节棘突骨剪", "双关节咬骨剪", "骨剪", "膝关节韧带手术剪", "钢丝剪", "颈椎咬骨钳", "颈椎双关节咬骨钳", "脊柱侧弯矫正钳", "髓核钳", "椎板咬骨钳", "弯头平口棘突骨钳", "枪形咬骨钳", "膝关节息肉钳", "咬骨钳", "持骨钳", "腐骨钳", "复位钳", "持钉钳", "持板钳", "持棒钳", "持钩钳", "螺杆夹持钳", "撑开钳", "压缩钳", "枪形取样钳", "骨克丝钳", "钢板弯曲钳", "钢丝钳", "环锯", "腰椎用梯形骨凿", "椎间盘手术用环锯", "椎板剥离器", "颈椎测深凿", "弓锯", "指锯", "骨锯", "小园刮凿", "丁字凿", "骨锉", "弧形凿", "髋关节成型凿", "石膏锯", "梯形铲", "肘关节肱骨成型骨凿", "髓腔锉", "椎管锉", "骨凿", "座导凿", "单侧椎板拉钩", "半月板钩", "下肢截断拉钩", "骨钩", "颈椎拉钩", "颈前路深部缝合针", "骨牵引针", "加压螺纹钉导引针", "颈椎刮匙", "可变神经剥离子器", "风动开颅器", "电池式自停颅骨钻", "电动胸骨锯", "电动骨钻", "电动石膏剪", "电动石膏锯", "肢体延长架", "多功能单侧外固定支架", "碎胎刀", "子宫剪", "剖腹产剪", "脐带剪", "会阴剪", "产钳", "剖腹产切口钳", "妇科组织钳", "子宫颈活体取样钳", "子宫夹持钳", "妇科分离钳", "胎盘钳", "环形输卵管镊", "子宫拉钩", "阴道拉钩", "断头钩", "子宫探针", "腹水穿刺针", "碎颅器", "输卵管通夜器", "阴道牵开器", "会阴牵开器", "骨盆测量计", "输精管分离钳", "输精管皮外固定钳", "子宫刮匙", "输卵管提取板", "一次性使用无菌注射器", "一次性使用无菌注射针", "一次性使用光纤针", "一次性配药用注射针", "玻璃注射器", "辊轴取皮刀", "鼻手术刀", "指骨凿", "颌骨夹持钳", "肌腱夹持钳", "肌腱穿刺钳", "软骨塑型钳", "皮肤镊", "眼睑镊", "唇夹", "鼓式取皮机", "烧伤植皮三用机", "肌腱分离器", "肌腱剥离器", "筋膜套切器", "皮肤疣圈断器", "嘴形撑开器", "电子体温计", "红外耳蜗体温计", "腋下体温计", "皮肤体温计", "液晶体温计", "无创性电子血压计", "立式血压计", "血压表", "小儿血压表", "肺活量计", "双简肺功能测定器", "听诊器", "额戴听诊器", "胎音听诊器", "打诊锤", "脑打诊锤", "多用途叩诊锤", "额戴反光镜", "电额灯", "反光喉镜", "聚光灯", "反光灯", "检眼灯", "头灯", "卡片投影仪", "视力表灯", "视力检查仪", "遮眼器", "标准视力字标", "血流变数据处理软件", "激光(血液分析仪", "激光全息检测仪)数据分析软件", "远程诊断", "医用冰箱", "血分析", "灭菌器", "手术刀柄", "柳叶刀", "铲刀", "挑刀", "锋刀", "修脚刀", "修甲刀", "手术刀片", "简易镊", "灭菌柜", "医用培养箱", "凝血分析仪", "生物安全柜", "切开刀", "无菌刀片", "输氧面罩", "吸入器", "吸引管", "引流管", "导尿包", "吸痰包", "肠镜", "电子镜", "宫腔镜", "鼻咽喉镜", "胸腔镜", "肠胃镜", "十二指肠镜", "光学放大镜", "小肠镜", "脑室镜", "腰间盘镜", "腰椎间盘镜", "椎间镜", "鼻窦镜", "食道镜镜", "子宫镜镜", "消化道镜", "肾孟镜", "插管镜", "肠内镜", "电子内镜", "胆道内镜", "腹腔内镜", "胃肠内镜", "胃内镜", "膀胱内镜", "输尿管内镜", "电切内镜", "肾内镜", "宫腔内镜", "阴道内镜", "支气管内镜", "鼻咽喉内镜", "胸腔内镜", "肠胃内镜", "十二指肠内镜", "光学放大内镜", "小肠内镜", "关节内镜", "脑室内镜", "腰间盘内镜", "腰椎间盘内镜", "椎间孔内镜", "椎间内镜", "鼻窦内镜", "喉内镜", "食道镜内镜", "子宫镜内镜", "结肠内镜", "消化道内镜", "肛肠内镜", "肾孟内镜", "大肠内镜", "插管内镜", "制氧机", "制氮机", "氧气机", "氧气呼吸机", "消毒机", "洗板机", "吸氧机", "伟康呼吸机", "万曼呼吸机", "碎石机", "乳腺机", "清洗机", "离心机", "机械通气", "光固化机", "纯水机", "透视机", "水机", "健康一体机", "射线机", "AED训练机", "医用胶片打印机", "封口机", "牙科手机", "磨边机", "注射器", "助行器", "荧光检测器", "移液器", "消毒器", "雾化器", "试验器", "生物容器", "生命科学仪器", "清洗器", "牵引器", "器械柜", "喷雾器", "矫正器", "监测仪器", "美容仪器", "呼吸器", "骨科医疗器械", "骨科器械", "干式恒温器", "负压引流器", "负压吸引器", "电凝器", "电动吸引器", "麻醉蒸发器", "供氧器", "呼吸训练器", "氧气吸入器", "光学放大器", "洗眼器", "生物阅读器", "站立器", "器械镊", "液仪器", "分液器", "冲洗器", "灌注器", "利器盒", "圈套器", "质谱仪", "血分析仪", "心电监护仪", "细胞计数仪", "生化仪", "筛查仪", "色谱仪", "溶氧仪", "尿仪", "密度仪", "酶标仪", "粒度仪", "理疗仪", "局放仪", "检测仪", "监测仪", "甲烷检测仪", "光疗仪", "干式氮吹仪", "分析仪", "定氮仪", "电穿孔仪", "探伤仪", "测氧仪", "测试仪", "采集仪", "记录仪", "黄疸仪", "脑电图仪", "止血仪", "复苏仪", "静脉显像仪", "康复仪", "熏蒸仪", "训练仪", "学位电刺激仪", "验光仪", "口腔扫描仪", "观察扫描仪", "荧光定量仪", "成像仪", "显微镜", "微镜", "塑形镜", "塑形角膜镜", "生物显微镜", "扫描电镜", "软镜", "盘镜", "内镜", "放大镜", "额镜", "电镜", "检查镜", "医用低温保存柜", "全自动核酸提取仪"};


        for (String aa : aas) {
            String keyword = aa ;
            List<NoticeMQ> mqEntities = contentSolr.companyResultsBaoXian( "yyyymmdd:[20161001 TO 20201022] AND progid:3 AND catid:[* TO 100] AND allcontent:\""+aa+"\"", keyword, 3);
            log.info("keyword:{}查询出了size：{}条数据", keyword, mqEntities.size());
            if (!mqEntities.isEmpty()) {
                for (NoticeMQ data : mqEntities) {
                    list1.add(data);
                    if (!dataMap.containsKey(data.getContentid().toString())) {
                        list.add(data);
                        data.setKeyword(keyword);
                        dataMap.put(data.getContentid().toString(), "0");
                    }
                }
            }
        }


        for (Future future1 : futureList1) {
            try {
                future1.get();
            } catch (InterruptedException e) {
                e.printStackTrace();
                executorService1.shutdown();
            } catch (ExecutionException e) {
                e.printStackTrace();
            }
        }
        executorService1.shutdown();


        log.info("全部数据量："+list1.size());
        log.info("去重之后的数据量："+list.size());
        log.info("==========================");


        if (list != null && list.size() > 0) {
            ExecutorService executorService = Executors.newFixedThreadPool(80);
            List<Future> futureList = new ArrayList<>();
            for (NoticeMQ content : list) {
                futureList.add(executorService.submit(() ->  getDataFromZhongTaiAndSave(content)));
            }
            for (Future future : futureList) {
                try {
                    future.get();
                } catch (InterruptedException e) {
                    e.printStackTrace();
                } catch (ExecutionException e) {
                    e.printStackTrace();
                }
            }
            executorService.shutdown();
        }
        log.info("数据全部跑完啦,总数量为：" +1);

    }

    String[] bbs = { "医院", "急救", "抢救", "诊所", "门诊", "救护", "医学院", "救治", "保健院", "健康委员会", "体检中心", "健康局", "医院部", "药房", "卫生院", "医疗", "卫生所", "医疗保障局", "合作医疗", "医药服务管理司", "兽医实验室", "医药", "精神病院", "防治院", "血液中心", "眼科中心", "治疗中心", "保健中心", "保健所", "血管病研究所", "防治所", "外科中心", "康复中心", "透析中心", "正畸中心", "荣军院", "防治中心", "保健站", "列腺病研究所", "职业病院", "防治站", "产院", "急救中心", "卫生局", "卫生厅", "防治办公室", "卫生保健中心", "医疗中心", "卫生中心", "门诊部", "卫生服务站", "医检所", "制剂室", "药交所", "戒毒所", "敬老院", "疗养院", "眼病防治所", "矫治所", "结核病防治所", "休养所", "血站", "福利院", "医疗机构", "病防治办公室", "疾病", "健康", "妇幼", "军医", "医用", "诊疗", "残联", "医护", "卫生院", "卫生院校", "医科大学", "健康中心", "运动康复", "中医", "预防控制", "医务" };

    public void getDataFromZhongTaiAndSave(NoticeMQ noticeMQ){
        boolean result = zhongTaiService.checkStatus(noticeMQ.getContentid().toString());
        if (result == false){
            log.info("contentid:{} 对应的数据状态不是99, 丢弃" , noticeMQ.getContentid().toString());
            return;
        }
        Map<String, Object> resultMap = zhongTaiService.handleZhongTaiGetResultMap(noticeMQ, areaMap);
        if (resultMap != null) {
            String title = resultMap.get("title") != null ? resultMap.get("title").toString() : "";
            String zhao_biao_unit = resultMap.get("zhao_biao_unit") != null ? resultMap.get("zhao_biao_unit").toString() : "";

            boolean flag = false;

            for (String bb : bbs) {
                if (title.contains(bb.toUpperCase())){
                    flag = true;
                    break;
                }
            }

            if ( ! flag){
                for (String bb : bbs) {
                    if (zhao_biao_unit.contains(bb.toUpperCase())){
                        flag = true;
                        break;
                    }
                }
            }

            if (flag){
                zhongTaiService.saveIntoMysql(resultMap);
            }

        }

    }

}
